let age:number = 61;
let disc:boolean = false;

if( age < 12 ){
    if(disc===true){
        console.log(`คุณอายุ ${age} ตั๋วปกติราคา 60 บาท\n ได้รับส่วนลด 10%: ราคาสุทธิ ${60-(60*0.10)}`);
    }else{
        console.log(`คุณอายุ ${age} ตั๋วปกติราคา 60 บาท\n ได้รับส่วนลด 0%: ราคาสุทธิ ${60}`);
    }
}else if( age <= 59){
    if(disc===true){
        console.log(`คุณอายุ ${age} ตั๋วปกติราคา 120 บาท\n ได้รับส่วนลด 10%: ราคาสุทธิ ${120-(120*0.10)}`);
    }else{
        console.log(`คุณอายุ ${age} ตั๋วปกติราคา 120 บาท\n ได้รับส่วนลด 0%: ราคาสุทธิ ${120}`);
    }
}else if(age >= 60 ){
        if(disc===true){
        console.log(`คุณอายุ ${age} ตั๋วปกติราคา 100 บาท\n ได้รับส่วนลด 10%: ราคาสุทธิ ${100-(100*0.10)}`);
    }else{
        console.log(`คุณอายุ ${age} ตั๋วปกติราคา 100 บาท\n ได้รับส่วนลด 0%: ราคาสุทธิ ${100}`);
    }
}